# 1. Открыть файл
# 2. Сохранить файл
# 3. Показать все контакты
# 4. Создать контакт
# 5. Удалить контакт
# 6. Изменить контакт
# 7. Найти контакт
# 8. Выход из программы

def menu():
    print("Выберите пункт меню: ")
    print("1. Открыть файл\n2. Сохранить файл\n3. Показать все контакты\n4. Создать контакт\n5. Удалить контакт\n6. Изменить контакт\n7. Найти контакт\n8. Выход из программы")
    request = int(input())
    return request


        




